grevaillot/svd_tools/headers/ATSAMV71J19B/pwm0.h
#define PWM0_PWM_CLK_PREB_SHIFT		24
#define PWM0_PWM_CLK_PREB_MASK		0x0f
/** @defgroup pwm0_pwm_clk_preb PREB CLKB Source Clock Selection
@{*/
/**@}*/


#define PWM0_PWM_CLK_DIVB_SHIFT		16
#define PWM0_PWM_CLK_DIVB_MASK		0xff
/** @defgroup pwm0_pwm_clk_divb DIVB CLKB Divide Factor
@{*/
/**@}*/


#define PWM0_PWM_CLK_PREA_SHIFT		8
#define PWM0_PWM_CLK_PREA_MASK		0x0f
/** @defgroup pwm0_pwm_clk_prea PREA CLKA Source Clock Selection
@{*/
/**@}*/


#define PWM0_PWM_CLK_DIVA_SHIFT		0
#define PWM0_PWM_CLK_DIVA_MASK		0xff
/** @defgroup pwm0_pwm_clk_diva DIVA CLKA Divide Factor
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_ena PWMENA PWM Enable Register
@{*/

/** PWM0_PWM_ENA_CHID3 Channel ID **/
#define PWM0_PWM_ENA_CHID3		(1 << 3)
/** PWM0_PWM_ENA_CHID2 Channel ID **/
#define PWM0_PWM_ENA_CHID2		(1 << 2)
/** PWM0_PWM_ENA_CHID1 Channel ID **/
#define PWM0_PWM_ENA_CHID1		(1 << 1)
/** PWM0_PWM_ENA_CHID0 Channel ID **/
#define PWM0_PWM_ENA_CHID0		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_dis PWMDIS PWM Disable Register
@{*/

/** PWM0_PWM_DIS_CHID3 Channel ID **/
#define PWM0_PWM_DIS_CHID3		(1 << 3)
/** PWM0_PWM_DIS_CHID2 Channel ID **/
#define PWM0_PWM_DIS_CHID2		(1 << 2)
/** PWM0_PWM_DIS_CHID1 Channel ID **/
#define PWM0_PWM_DIS_CHID1		(1 << 1)
/** PWM0_PWM_DIS_CHID0 Channel ID **/
#define PWM0_PWM_DIS_CHID0		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_sr PWMSR PWM Status Register
@{*/

/** PWM0_PWM_SR_CHID3 Channel ID **/
#define PWM0_PWM_SR_CHID3		(1 << 3)
/** PWM0_PWM_SR_CHID2 Channel ID **/
#define PWM0_PWM_SR_CHID2		(1 << 2)
/** PWM0_PWM_SR_CHID1 Channel ID **/
#define PWM0_PWM_SR_CHID1		(1 << 1)
/** PWM0_PWM_SR_CHID0 Channel ID **/
#define PWM0_PWM_SR_CHID0		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_ier1 PWMIER1 PWM Interrupt Enable Register 1
@{*/

/** PWM0_PWM_IER1_FCHID3 Fault Protection Trigger on Channel 3 Interrupt Enable **/
#define PWM0_PWM_IER1_FCHID3		(1 << 19)
/** PWM0_PWM_IER1_FCHID2 Fault Protection Trigger on Channel 2 Interrupt Enable **/
#define PWM0_PWM_IER1_FCHID2		(1 << 18)
/** PWM0_PWM_IER1_FCHID1 Fault Protection Trigger on Channel 1 Interrupt Enable **/
#define PWM0_PWM_IER1_FCHID1		(1 << 17)
/** PWM0_PWM_IER1_FCHID0 Fault Protection Trigger on Channel 0 Interrupt Enable **/
#define PWM0_PWM_IER1_FCHID0		(1 << 16)
/** PWM0_PWM_IER1_CHID3 Counter Event on Channel 3 Interrupt Enable **/
#define PWM0_PWM_IER1_CHID3		(1 << 3)
/** PWM0_PWM_IER1_CHID2 Counter Event on Channel 2 Interrupt Enable **/
#define PWM0_PWM_IER1_CHID2		(1 << 2)
/** PWM0_PWM_IER1_CHID1 Counter Event on Channel 1 Interrupt Enable **/
#define PWM0_PWM_IER1_CHID1		(1 << 1)
/** PWM0_PWM_IER1_CHID0 Counter Event on Channel 0 Interrupt Enable **/
#define PWM0_PWM_IER1_CHID0		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_idr1 PWMIDR1 PWM Interrupt Disable Register 1
@{*/

/** PWM0_PWM_IDR1_FCHID3 Fault Protection Trigger on Channel 3 Interrupt Disable **/
#define PWM0_PWM_IDR1_FCHID3		(1 << 19)
/** PWM0_PWM_IDR1_FCHID2 Fault Protection Trigger on Channel 2 Interrupt Disable **/
#define PWM0_PWM_IDR1_FCHID2		(1 << 18)
/** PWM0_PWM_IDR1_FCHID1 Fault Protection Trigger on Channel 1 Interrupt Disable **/
#define PWM0_PWM_IDR1_FCHID1		(1 << 17)
/** PWM0_PWM_IDR1_FCHID0 Fault Protection Trigger on Channel 0 Interrupt Disable **/
#define PWM0_PWM_IDR1_FCHID0		(1 << 16)
/** PWM0_PWM_IDR1_CHID3 Counter Event on Channel 3 Interrupt Disable **/
#define PWM0_PWM_IDR1_CHID3		(1 << 3)
/** PWM0_PWM_IDR1_CHID2 Counter Event on Channel 2 Interrupt Disable **/
#define PWM0_PWM_IDR1_CHID2		(1 << 2)
/** PWM0_PWM_IDR1_CHID1 Counter Event on Channel 1 Interrupt Disable **/
#define PWM0_PWM_IDR1_CHID1		(1 << 1)
/** PWM0_PWM_IDR1_CHID0 Counter Event on Channel 0 Interrupt Disable **/
#define PWM0_PWM_IDR1_CHID0		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_imr1 PWMIMR1 PWM Interrupt Mask Register 1
@{*/

/** PWM0_PWM_IMR1_FCHID3 Fault Protection Trigger on Channel 3 Interrupt Mask **/
#define PWM0_PWM_IMR1_FCHID3		(1 << 19)
/** PWM0_PWM_IMR1_FCHID2 Fault Protection Trigger on Channel 2 Interrupt Mask **/
#define PWM0_PWM_IMR1_FCHID2		(1 << 18)
/** PWM0_PWM_IMR1_FCHID1 Fault Protection Trigger on Channel 1 Interrupt Mask **/
#define PWM0_PWM_IMR1_FCHID1		(1 << 17)
/** PWM0_PWM_IMR1_FCHID0 Fault Protection Trigger on Channel 0 Interrupt Mask **/
#define PWM0_PWM_IMR1_FCHID0		(1 << 16)
/** PWM0_PWM_IMR1_CHID3 Counter Event on Channel 3 Interrupt Mask **/
#define PWM0_PWM_IMR1_CHID3		(1 << 3)
/** PWM0_PWM_IMR1_CHID2 Counter Event on Channel 2 Interrupt Mask **/
#define PWM0_PWM_IMR1_CHID2		(1 << 2)
/** PWM0_PWM_IMR1_CHID1 Counter Event on Channel 1 Interrupt Mask **/
#define PWM0_PWM_IMR1_CHID1		(1 << 1)
/** PWM0_PWM_IMR1_CHID0 Counter Event on Channel 0 Interrupt Mask **/
#define PWM0_PWM_IMR1_CHID0		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_isr1 PWMISR1 PWM Interrupt Status Register 1
@{*/

/** PWM0_PWM_ISR1_FCHID3 Fault Protection Trigger on Channel 3 **/
#define PWM0_PWM_ISR1_FCHID3		(1 << 19)
/** PWM0_PWM_ISR1_FCHID2 Fault Protection Trigger on Channel 2 **/
#define PWM0_PWM_ISR1_FCHID2		(1 << 18)
/** PWM0_PWM_ISR1_FCHID1 Fault Protection Trigger on Channel 1 **/
#define PWM0_PWM_ISR1_FCHID1		(1 << 17)
/** PWM0_PWM_ISR1_FCHID0 Fault Protection Trigger on Channel 0 **/
#define PWM0_PWM_ISR1_FCHID0		(1 << 16)
/** PWM0_PWM_ISR1_CHID3 Counter Event on Channel 3 **/
#define PWM0_PWM_ISR1_CHID3		(1 << 3)
/** PWM0_PWM_ISR1_CHID2 Counter Event on Channel 2 **/
#define PWM0_PWM_ISR1_CHID2		(1 << 2)
/** PWM0_PWM_ISR1_CHID1 Counter Event on Channel 1 **/
#define PWM0_PWM_ISR1_CHID1		(1 << 1)
/** PWM0_PWM_ISR1_CHID0 Counter Event on Channel 0 **/
#define PWM0_PWM_ISR1_CHID0		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_scm PWMSCM PWM Sync Channels Mode Register
@{*/


#define PWM0_PWM_SCM_PTRCS_SHIFT		21
#define PWM0_PWM_SCM_PTRCS_MASK		0x07
/** @defgroup pwm0_pwm_scm_ptrcs PTRCS DMA Controller Transfer Request Comparison Selection
@{*/
/**@}*/

/** PWM0_PWM_SCM_PTRM DMA Controller Transfer Request Mode **/
#define PWM0_PWM_SCM_PTRM		(1 << 20)

#define PWM0_PWM_SCM_UPDM_SHIFT		16
#define PWM0_PWM_SCM_UPDM_MASK		0x03
/** @defgroup pwm0_pwm_scm_updm UPDM Synchronous Channels Update Mode
@{*/
/**@}*/

