grevaillot/svd_tools/headers/ATSAMV71J19B/pwm0.h
/** PWM0_PWM_SCM_SYNC3 Synchronous Channel 3 **/
#define PWM0_PWM_SCM_SYNC3		(1 << 3)
/** PWM0_PWM_SCM_SYNC2 Synchronous Channel 2 **/
#define PWM0_PWM_SCM_SYNC2		(1 << 2)
/** PWM0_PWM_SCM_SYNC1 Synchronous Channel 1 **/
#define PWM0_PWM_SCM_SYNC1		(1 << 1)
/** PWM0_PWM_SCM_SYNC0 Synchronous Channel 0 **/
#define PWM0_PWM_SCM_SYNC0		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_dmar PWMDMAR PWM DMA Register
@{*/


#define PWM0_PWM_DMAR_DMADUTY_SHIFT		0
#define PWM0_PWM_DMAR_DMADUTY_MASK		0xffffff
/** @defgroup pwm0_pwm_dmar_dmaduty DMADUTY Duty-Cycle Holding Register for DMA Access
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_scuc PWMSCUC PWM Sync Channels Update Control Register
@{*/

/** PWM0_PWM_SCUC_UPDULOCK Synchronous Channels Update Unlock **/
#define PWM0_PWM_SCUC_UPDULOCK		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_scup PWMSCUP PWM Sync Channels Update Period Register
@{*/


#define PWM0_PWM_SCUP_UPRCNT_SHIFT		4
#define PWM0_PWM_SCUP_UPRCNT_MASK		0x0f
/** @defgroup pwm0_pwm_scup_uprcnt UPRCNT Update Period Counter
@{*/
/**@}*/


#define PWM0_PWM_SCUP_UPR_SHIFT		0
#define PWM0_PWM_SCUP_UPR_MASK		0x0f
/** @defgroup pwm0_pwm_scup_upr UPR Update Period
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_scupupd PWMSCUPUPD PWM Sync Channels Update Period Update Register
@{*/


#define PWM0_PWM_SCUPUPD_UPRUPD_SHIFT		0
#define PWM0_PWM_SCUPUPD_UPRUPD_MASK		0x0f
/** @defgroup pwm0_pwm_scupupd_uprupd UPRUPD Update Period Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_ier2 PWMIER2 PWM Interrupt Enable Register 2
@{*/

/** PWM0_PWM_IER2_CMPU7 Comparison 7 Update Interrupt Enable **/
#define PWM0_PWM_IER2_CMPU7		(1 << 23)
/** PWM0_PWM_IER2_CMPU6 Comparison 6 Update Interrupt Enable **/
#define PWM0_PWM_IER2_CMPU6		(1 << 22)
/** PWM0_PWM_IER2_CMPU5 Comparison 5 Update Interrupt Enable **/
#define PWM0_PWM_IER2_CMPU5		(1 << 21)
/** PWM0_PWM_IER2_CMPU4 Comparison 4 Update Interrupt Enable **/
#define PWM0_PWM_IER2_CMPU4		(1 << 20)
/** PWM0_PWM_IER2_CMPU3 Comparison 3 Update Interrupt Enable **/
#define PWM0_PWM_IER2_CMPU3		(1 << 19)
/** PWM0_PWM_IER2_CMPU2 Comparison 2 Update Interrupt Enable **/
#define PWM0_PWM_IER2_CMPU2		(1 << 18)
/** PWM0_PWM_IER2_CMPU1 Comparison 1 Update Interrupt Enable **/
#define PWM0_PWM_IER2_CMPU1		(1 << 17)
/** PWM0_PWM_IER2_CMPU0 Comparison 0 Update Interrupt Enable **/
#define PWM0_PWM_IER2_CMPU0		(1 << 16)
/** PWM0_PWM_IER2_CMPM7 Comparison 7 Match Interrupt Enable **/
#define PWM0_PWM_IER2_CMPM7		(1 << 15)
/** PWM0_PWM_IER2_CMPM6 Comparison 6 Match Interrupt Enable **/
#define PWM0_PWM_IER2_CMPM6		(1 << 14)
/** PWM0_PWM_IER2_CMPM5 Comparison 5 Match Interrupt Enable **/
#define PWM0_PWM_IER2_CMPM5		(1 << 13)
/** PWM0_PWM_IER2_CMPM4 Comparison 4 Match Interrupt Enable **/
#define PWM0_PWM_IER2_CMPM4		(1 << 12)
/** PWM0_PWM_IER2_CMPM3 Comparison 3 Match Interrupt Enable **/
#define PWM0_PWM_IER2_CMPM3		(1 << 11)
/** PWM0_PWM_IER2_CMPM2 Comparison 2 Match Interrupt Enable **/
#define PWM0_PWM_IER2_CMPM2		(1 << 10)
/** PWM0_PWM_IER2_CMPM1 Comparison 1 Match Interrupt Enable **/
#define PWM0_PWM_IER2_CMPM1		(1 << 9)
/** PWM0_PWM_IER2_CMPM0 Comparison 0 Match Interrupt Enable **/
#define PWM0_PWM_IER2_CMPM0		(1 << 8)
/** PWM0_PWM_IER2_UNRE Synchronous Channels Update Underrun Error Interrupt Enable **/
#define PWM0_PWM_IER2_UNRE		(1 << 3)
/** PWM0_PWM_IER2_WRDY Write Ready for Synchronous Channels Update Interrupt Enable **/
#define PWM0_PWM_IER2_WRDY		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_idr2 PWMIDR2 PWM Interrupt Disable Register 2
@{*/

/** PWM0_PWM_IDR2_CMPU7 Comparison 7 Update Interrupt Disable **/
#define PWM0_PWM_IDR2_CMPU7		(1 << 23)
/** PWM0_PWM_IDR2_CMPU6 Comparison 6 Update Interrupt Disable **/
#define PWM0_PWM_IDR2_CMPU6		(1 << 22)
/** PWM0_PWM_IDR2_CMPU5 Comparison 5 Update Interrupt Disable **/
#define PWM0_PWM_IDR2_CMPU5		(1 << 21)
/** PWM0_PWM_IDR2_CMPU4 Comparison 4 Update Interrupt Disable **/
#define PWM0_PWM_IDR2_CMPU4		(1 << 20)
/** PWM0_PWM_IDR2_CMPU3 Comparison 3 Update Interrupt Disable **/
#define PWM0_PWM_IDR2_CMPU3		(1 << 19)
/** PWM0_PWM_IDR2_CMPU2 Comparison 2 Update Interrupt Disable **/
#define PWM0_PWM_IDR2_CMPU2		(1 << 18)
/** PWM0_PWM_IDR2_CMPU1 Comparison 1 Update Interrupt Disable **/
#define PWM0_PWM_IDR2_CMPU1		(1 << 17)
/** PWM0_PWM_IDR2_CMPU0 Comparison 0 Update Interrupt Disable **/
#define PWM0_PWM_IDR2_CMPU0		(1 << 16)
/** PWM0_PWM_IDR2_CMPM7 Comparison 7 Match Interrupt Disable **/
#define PWM0_PWM_IDR2_CMPM7		(1 << 15)
/** PWM0_PWM_IDR2_CMPM6 Comparison 6 Match Interrupt Disable **/
#define PWM0_PWM_IDR2_CMPM6		(1 << 14)
/** PWM0_PWM_IDR2_CMPM5 Comparison 5 Match Interrupt Disable **/
#define PWM0_PWM_IDR2_CMPM5		(1 << 13)
/** PWM0_PWM_IDR2_CMPM4 Comparison 4 Match Interrupt Disable **/
#define PWM0_PWM_IDR2_CMPM4		(1 << 12)
/** PWM0_PWM_IDR2_CMPM3 Comparison 3 Match Interrupt Disable **/
#define PWM0_PWM_IDR2_CMPM3		(1 << 11)
/** PWM0_PWM_IDR2_CMPM2 Comparison 2 Match Interrupt Disable **/
#define PWM0_PWM_IDR2_CMPM2		(1 << 10)
/** PWM0_PWM_IDR2_CMPM1 Comparison 1 Match Interrupt Disable **/
#define PWM0_PWM_IDR2_CMPM1		(1 << 9)
/** PWM0_PWM_IDR2_CMPM0 Comparison 0 Match Interrupt Disable **/
#define PWM0_PWM_IDR2_CMPM0		(1 << 8)
/** PWM0_PWM_IDR2_UNRE Synchronous Channels Update Underrun Error Interrupt Disable **/
#define PWM0_PWM_IDR2_UNRE		(1 << 3)
/** PWM0_PWM_IDR2_WRDY Write Ready for Synchronous Channels Update Interrupt Disable **/
#define PWM0_PWM_IDR2_WRDY		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_imr2 PWMIMR2 PWM Interrupt Mask Register 2
@{*/

/** PWM0_PWM_IMR2_CMPU7 Comparison 7 Update Interrupt Mask **/
#define PWM0_PWM_IMR2_CMPU7		(1 << 23)
/** PWM0_PWM_IMR2_CMPU6 Comparison 6 Update Interrupt Mask **/
#define PWM0_PWM_IMR2_CMPU6		(1 << 22)
/** PWM0_PWM_IMR2_CMPU5 Comparison 5 Update Interrupt Mask **/
#define PWM0_PWM_IMR2_CMPU5		(1 << 21)
/** PWM0_PWM_IMR2_CMPU4 Comparison 4 Update Interrupt Mask **/
#define PWM0_PWM_IMR2_CMPU4		(1 << 20)
/** PWM0_PWM_IMR2_CMPU3 Comparison 3 Update Interrupt Mask **/
#define PWM0_PWM_IMR2_CMPU3		(1 << 19)
/** PWM0_PWM_IMR2_CMPU2 Comparison 2 Update Interrupt Mask **/
#define PWM0_PWM_IMR2_CMPU2		(1 << 18)
/** PWM0_PWM_IMR2_CMPU1 Comparison 1 Update Interrupt Mask **/
#define PWM0_PWM_IMR2_CMPU1		(1 << 17)
/** PWM0_PWM_IMR2_CMPU0 Comparison 0 Update Interrupt Mask **/
#define PWM0_PWM_IMR2_CMPU0		(1 << 16)
/** PWM0_PWM_IMR2_CMPM7 Comparison 7 Match Interrupt Mask **/
#define PWM0_PWM_IMR2_CMPM7		(1 << 15)
/** PWM0_PWM_IMR2_CMPM6 Comparison 6 Match Interrupt Mask **/
#define PWM0_PWM_IMR2_CMPM6		(1 << 14)
/** PWM0_PWM_IMR2_CMPM5 Comparison 5 Match Interrupt Mask **/
#define PWM0_PWM_IMR2_CMPM5		(1 << 13)
/** PWM0_PWM_IMR2_CMPM4 Comparison 4 Match Interrupt Mask **/
#define PWM0_PWM_IMR2_CMPM4		(1 << 12)
/** PWM0_PWM_IMR2_CMPM3 Comparison 3 Match Interrupt Mask **/
#define PWM0_PWM_IMR2_CMPM3		(1 << 11)
/** PWM0_PWM_IMR2_CMPM2 Comparison 2 Match Interrupt Mask **/
#define PWM0_PWM_IMR2_CMPM2		(1 << 10)
/** PWM0_PWM_IMR2_CMPM1 Comparison 1 Match Interrupt Mask **/
#define PWM0_PWM_IMR2_CMPM1		(1 << 9)
/** PWM0_PWM_IMR2_CMPM0 Comparison 0 Match Interrupt Mask **/
#define PWM0_PWM_IMR2_CMPM0		(1 << 8)
/** PWM0_PWM_IMR2_UNRE Synchronous Channels Update Underrun Error Interrupt Mask **/
#define PWM0_PWM_IMR2_UNRE		(1 << 3)
/** PWM0_PWM_IMR2_WRDY Write Ready for Synchronous Channels Update Interrupt Mask **/
#define PWM0_PWM_IMR2_WRDY		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_isr2 PWMISR2 PWM Interrupt Status Register 2
@{*/

/** PWM0_PWM_ISR2_CMPU7 Comparison 7 Update **/
#define PWM0_PWM_ISR2_CMPU7		(1 << 23)
/** PWM0_PWM_ISR2_CMPU6 Comparison 6 Update **/
#define PWM0_PWM_ISR2_CMPU6		(1 << 22)
/** PWM0_PWM_ISR2_CMPU5 Comparison 5 Update **/
#define PWM0_PWM_ISR2_CMPU5		(1 << 21)
/** PWM0_PWM_ISR2_CMPU4 Comparison 4 Update **/
#define PWM0_PWM_ISR2_CMPU4		(1 << 20)
/** PWM0_PWM_ISR2_CMPU3 Comparison 3 Update **/
#define PWM0_PWM_ISR2_CMPU3		(1 << 19)
/** PWM0_PWM_ISR2_CMPU2 Comparison 2 Update **/
#define PWM0_PWM_ISR2_CMPU2		(1 << 18)
/** PWM0_PWM_ISR2_CMPU1 Comparison 1 Update **/
#define PWM0_PWM_ISR2_CMPU1		(1 << 17)
/** PWM0_PWM_ISR2_CMPU0 Comparison 0 Update **/
#define PWM0_PWM_ISR2_CMPU0		(1 << 16)
/** PWM0_PWM_ISR2_CMPM7 Comparison 7 Match **/
#define PWM0_PWM_ISR2_CMPM7		(1 << 15)
/** PWM0_PWM_ISR2_CMPM6 Comparison 6 Match **/
#define PWM0_PWM_ISR2_CMPM6		(1 << 14)
/** PWM0_PWM_ISR2_CMPM5 Comparison 5 Match **/
#define PWM0_PWM_ISR2_CMPM5		(1 << 13)
/** PWM0_PWM_ISR2_CMPM4 Comparison 4 Match **/
#define PWM0_PWM_ISR2_CMPM4		(1 << 12)
/** PWM0_PWM_ISR2_CMPM3 Comparison 3 Match **/
#define PWM0_PWM_ISR2_CMPM3		(1 << 11)
/** PWM0_PWM_ISR2_CMPM2 Comparison 2 Match **/
#define PWM0_PWM_ISR2_CMPM2		(1 << 10)
/** PWM0_PWM_ISR2_CMPM1 Comparison 1 Match **/
#define PWM0_PWM_ISR2_CMPM1		(1 << 9)
/** PWM0_PWM_ISR2_CMPM0 Comparison 0 Match **/
#define PWM0_PWM_ISR2_CMPM0		(1 << 8)
/** PWM0_PWM_ISR2_UNRE Synchronous Channels Update Underrun Error **/
#define PWM0_PWM_ISR2_UNRE		(1 << 3)
/** PWM0_PWM_ISR2_WRDY Write Ready for Synchronous Channels Update **/
#define PWM0_PWM_ISR2_WRDY		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_oov PWMOOV PWM Output Override Value Register
@{*/

/** PWM0_PWM_OOV_OOVL3 Output Override Value for PWML output of the channel 3 **/
#define PWM0_PWM_OOV_OOVL3		(1 << 19)
/** PWM0_PWM_OOV_OOVL2 Output Override Value for PWML output of the channel 2 **/
#define PWM0_PWM_OOV_OOVL2		(1 << 18)
/** PWM0_PWM_OOV_OOVL1 Output Override Value for PWML output of the channel 1 **/
#define PWM0_PWM_OOV_OOVL1		(1 << 17)
/** PWM0_PWM_OOV_OOVL0 Output Override Value for PWML output of the channel 0 **/
#define PWM0_PWM_OOV_OOVL0		(1 << 16)
/** PWM0_PWM_OOV_OOVH3 Output Override Value for PWMH output of the channel 3 **/
#define PWM0_PWM_OOV_OOVH3		(1 << 3)
/** PWM0_PWM_OOV_OOVH2 Output Override Value for PWMH output of the channel 2 **/
#define PWM0_PWM_OOV_OOVH2		(1 << 2)
/** PWM0_PWM_OOV_OOVH1 Output Override Value for PWMH output of the channel 1 **/
#define PWM0_PWM_OOV_OOVH1		(1 << 1)
/** PWM0_PWM_OOV_OOVH0 Output Override Value for PWMH output of the channel 0 **/
#define PWM0_PWM_OOV_OOVH0		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_os PWMOS PWM Output Selection Register
@{*/

/** PWM0_PWM_OS_OSL3 Output Selection for PWML output of the channel 3 **/
#define PWM0_PWM_OS_OSL3		(1 << 19)
/** PWM0_PWM_OS_OSL2 Output Selection for PWML output of the channel 2 **/
#define PWM0_PWM_OS_OSL2		(1 << 18)
/** PWM0_PWM_OS_OSL1 Output Selection for PWML output of the channel 1 **/
#define PWM0_PWM_OS_OSL1		(1 << 17)
/** PWM0_PWM_OS_OSL0 Output Selection for PWML output of the channel 0 **/
#define PWM0_PWM_OS_OSL0		(1 << 16)
/** PWM0_PWM_OS_OSH3 Output Selection for PWMH output of the channel 3 **/
#define PWM0_PWM_OS_OSH3		(1 << 3)
/** PWM0_PWM_OS_OSH2 Output Selection for PWMH output of the channel 2 **/
#define PWM0_PWM_OS_OSH2		(1 << 2)
/** PWM0_PWM_OS_OSH1 Output Selection for PWMH output of the channel 1 **/
#define PWM0_PWM_OS_OSH1		(1 << 1)
/** PWM0_PWM_OS_OSH0 Output Selection for PWMH output of the channel 0 **/
#define PWM0_PWM_OS_OSH0		(1 << 0)

/**@}*/

