grevaillot/svd_tools/headers/ATSAMV71J19B/pwm0.h
/** @defgroup pwm0_pwm_oss PWMOSS PWM Output Selection Set Register
@{*/

/** PWM0_PWM_OSS_OSSL3 Output Selection Set for PWML output of the channel 3 **/
#define PWM0_PWM_OSS_OSSL3		(1 << 19)
/** PWM0_PWM_OSS_OSSL2 Output Selection Set for PWML output of the channel 2 **/
#define PWM0_PWM_OSS_OSSL2		(1 << 18)
/** PWM0_PWM_OSS_OSSL1 Output Selection Set for PWML output of the channel 1 **/
#define PWM0_PWM_OSS_OSSL1		(1 << 17)
/** PWM0_PWM_OSS_OSSL0 Output Selection Set for PWML output of the channel 0 **/
#define PWM0_PWM_OSS_OSSL0		(1 << 16)
/** PWM0_PWM_OSS_OSSH3 Output Selection Set for PWMH output of the channel 3 **/
#define PWM0_PWM_OSS_OSSH3		(1 << 3)
/** PWM0_PWM_OSS_OSSH2 Output Selection Set for PWMH output of the channel 2 **/
#define PWM0_PWM_OSS_OSSH2		(1 << 2)
/** PWM0_PWM_OSS_OSSH1 Output Selection Set for PWMH output of the channel 1 **/
#define PWM0_PWM_OSS_OSSH1		(1 << 1)
/** PWM0_PWM_OSS_OSSH0 Output Selection Set for PWMH output of the channel 0 **/
#define PWM0_PWM_OSS_OSSH0		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_osc PWMOSC PWM Output Selection Clear Register
@{*/

/** PWM0_PWM_OSC_OSCL3 Output Selection Clear for PWML output of the channel 3 **/
#define PWM0_PWM_OSC_OSCL3		(1 << 19)
/** PWM0_PWM_OSC_OSCL2 Output Selection Clear for PWML output of the channel 2 **/
#define PWM0_PWM_OSC_OSCL2		(1 << 18)
/** PWM0_PWM_OSC_OSCL1 Output Selection Clear for PWML output of the channel 1 **/
#define PWM0_PWM_OSC_OSCL1		(1 << 17)
/** PWM0_PWM_OSC_OSCL0 Output Selection Clear for PWML output of the channel 0 **/
#define PWM0_PWM_OSC_OSCL0		(1 << 16)
/** PWM0_PWM_OSC_OSCH3 Output Selection Clear for PWMH output of the channel 3 **/
#define PWM0_PWM_OSC_OSCH3		(1 << 3)
/** PWM0_PWM_OSC_OSCH2 Output Selection Clear for PWMH output of the channel 2 **/
#define PWM0_PWM_OSC_OSCH2		(1 << 2)
/** PWM0_PWM_OSC_OSCH1 Output Selection Clear for PWMH output of the channel 1 **/
#define PWM0_PWM_OSC_OSCH1		(1 << 1)
/** PWM0_PWM_OSC_OSCH0 Output Selection Clear for PWMH output of the channel 0 **/
#define PWM0_PWM_OSC_OSCH0		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_ossupd PWMOSSUPD PWM Output Selection Set Update Register
@{*/

/** PWM0_PWM_OSSUPD_OSSUPL3 Output Selection Set for PWML output of the channel 3 **/
#define PWM0_PWM_OSSUPD_OSSUPL3		(1 << 19)
/** PWM0_PWM_OSSUPD_OSSUPL2 Output Selection Set for PWML output of the channel 2 **/
#define PWM0_PWM_OSSUPD_OSSUPL2		(1 << 18)
/** PWM0_PWM_OSSUPD_OSSUPL1 Output Selection Set for PWML output of the channel 1 **/
#define PWM0_PWM_OSSUPD_OSSUPL1		(1 << 17)
/** PWM0_PWM_OSSUPD_OSSUPL0 Output Selection Set for PWML output of the channel 0 **/
#define PWM0_PWM_OSSUPD_OSSUPL0		(1 << 16)
/** PWM0_PWM_OSSUPD_OSSUPH3 Output Selection Set for PWMH output of the channel 3 **/
#define PWM0_PWM_OSSUPD_OSSUPH3		(1 << 3)
/** PWM0_PWM_OSSUPD_OSSUPH2 Output Selection Set for PWMH output of the channel 2 **/
#define PWM0_PWM_OSSUPD_OSSUPH2		(1 << 2)
/** PWM0_PWM_OSSUPD_OSSUPH1 Output Selection Set for PWMH output of the channel 1 **/
#define PWM0_PWM_OSSUPD_OSSUPH1		(1 << 1)
/** PWM0_PWM_OSSUPD_OSSUPH0 Output Selection Set for PWMH output of the channel 0 **/
#define PWM0_PWM_OSSUPD_OSSUPH0		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_oscupd PWMOSCUPD PWM Output Selection Clear Update Register
@{*/

/** PWM0_PWM_OSCUPD_OSCUPL3 Output Selection Clear for PWML output of the channel 3 **/
#define PWM0_PWM_OSCUPD_OSCUPL3		(1 << 19)
/** PWM0_PWM_OSCUPD_OSCUPL2 Output Selection Clear for PWML output of the channel 2 **/
#define PWM0_PWM_OSCUPD_OSCUPL2		(1 << 18)
/** PWM0_PWM_OSCUPD_OSCUPL1 Output Selection Clear for PWML output of the channel 1 **/
#define PWM0_PWM_OSCUPD_OSCUPL1		(1 << 17)
/** PWM0_PWM_OSCUPD_OSCUPL0 Output Selection Clear for PWML output of the channel 0 **/
#define PWM0_PWM_OSCUPD_OSCUPL0		(1 << 16)
/** PWM0_PWM_OSCUPD_OSCUPH3 Output Selection Clear for PWMH output of the channel 3 **/
#define PWM0_PWM_OSCUPD_OSCUPH3		(1 << 3)
/** PWM0_PWM_OSCUPD_OSCUPH2 Output Selection Clear for PWMH output of the channel 2 **/
#define PWM0_PWM_OSCUPD_OSCUPH2		(1 << 2)
/** PWM0_PWM_OSCUPD_OSCUPH1 Output Selection Clear for PWMH output of the channel 1 **/
#define PWM0_PWM_OSCUPD_OSCUPH1		(1 << 1)
/** PWM0_PWM_OSCUPD_OSCUPH0 Output Selection Clear for PWMH output of the channel 0 **/
#define PWM0_PWM_OSCUPD_OSCUPH0		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_fmr PWMFMR PWM Fault Mode Register
@{*/


#define PWM0_PWM_FMR_FFIL_SHIFT		16
#define PWM0_PWM_FMR_FFIL_MASK		0xff
/** @defgroup pwm0_pwm_fmr_ffil FFIL Fault Filtering
@{*/
/**@}*/


#define PWM0_PWM_FMR_FMOD_SHIFT		8
#define PWM0_PWM_FMR_FMOD_MASK		0xff
/** @defgroup pwm0_pwm_fmr_fmod FMOD Fault Activation Mode
@{*/
/**@}*/


#define PWM0_PWM_FMR_FPOL_SHIFT		0
#define PWM0_PWM_FMR_FPOL_MASK		0xff
/** @defgroup pwm0_pwm_fmr_fpol FPOL Fault Polarity
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_fsr PWMFSR PWM Fault Status Register
@{*/


#define PWM0_PWM_FSR_FS_SHIFT		8
#define PWM0_PWM_FSR_FS_MASK		0xff
/** @defgroup pwm0_pwm_fsr_fs FS Fault Status
@{*/
/**@}*/


#define PWM0_PWM_FSR_FIV_SHIFT		0
#define PWM0_PWM_FSR_FIV_MASK		0xff
/** @defgroup pwm0_pwm_fsr_fiv FIV Fault Input Value
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_fcr PWMFCR PWM Fault Clear Register
@{*/


#define PWM0_PWM_FCR_FCLR_SHIFT		0
#define PWM0_PWM_FCR_FCLR_MASK		0xff
/** @defgroup pwm0_pwm_fcr_fclr FCLR Fault Clear
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_fpv1 PWMFPV1 PWM Fault Protection Value Register 1
@{*/

/** PWM0_PWM_FPV1_FPVL3 Fault Protection Value for PWML output on channel 3 **/
#define PWM0_PWM_FPV1_FPVL3		(1 << 19)
/** PWM0_PWM_FPV1_FPVL2 Fault Protection Value for PWML output on channel 2 **/
#define PWM0_PWM_FPV1_FPVL2		(1 << 18)
/** PWM0_PWM_FPV1_FPVL1 Fault Protection Value for PWML output on channel 1 **/
#define PWM0_PWM_FPV1_FPVL1		(1 << 17)
/** PWM0_PWM_FPV1_FPVL0 Fault Protection Value for PWML output on channel 0 **/
#define PWM0_PWM_FPV1_FPVL0		(1 << 16)
/** PWM0_PWM_FPV1_FPVH3 Fault Protection Value for PWMH output on channel 3 **/
#define PWM0_PWM_FPV1_FPVH3		(1 << 3)
/** PWM0_PWM_FPV1_FPVH2 Fault Protection Value for PWMH output on channel 2 **/
#define PWM0_PWM_FPV1_FPVH2		(1 << 2)
/** PWM0_PWM_FPV1_FPVH1 Fault Protection Value for PWMH output on channel 1 **/
#define PWM0_PWM_FPV1_FPVH1		(1 << 1)
/** PWM0_PWM_FPV1_FPVH0 Fault Protection Value for PWMH output on channel 0 **/
#define PWM0_PWM_FPV1_FPVH0		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_fpe PWMFPE PWM Fault Protection Enable Register
@{*/


#define PWM0_PWM_FPE_FPE3_SHIFT		24
#define PWM0_PWM_FPE_FPE3_MASK		0xff
/** @defgroup pwm0_pwm_fpe_fpe3 FPE3 Fault Protection Enable for channel 3
@{*/
/**@}*/


#define PWM0_PWM_FPE_FPE2_SHIFT		16
#define PWM0_PWM_FPE_FPE2_MASK		0xff
/** @defgroup pwm0_pwm_fpe_fpe2 FPE2 Fault Protection Enable for channel 2
@{*/
/**@}*/


#define PWM0_PWM_FPE_FPE1_SHIFT		8
#define PWM0_PWM_FPE_FPE1_MASK		0xff
/** @defgroup pwm0_pwm_fpe_fpe1 FPE1 Fault Protection Enable for channel 1
@{*/
/**@}*/


#define PWM0_PWM_FPE_FPE0_SHIFT		0
#define PWM0_PWM_FPE_FPE0_MASK		0xff
/** @defgroup pwm0_pwm_fpe_fpe0 FPE0 Fault Protection Enable for channel 0
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_elmr[0] PWMELMR[0] PWM Event Line 0 Mode Register 0
@{*/

