grevaillot/svd_tools/headers/ATSAMV71J19B/pwm0.h
/** PWM0_PWM_ELMR[0]_CSEL7 Comparison 7 Selection **/
#define PWM0_PWM_ELMR[0]_CSEL7		(1 << 7)
/** PWM0_PWM_ELMR[0]_CSEL6 Comparison 6 Selection **/
#define PWM0_PWM_ELMR[0]_CSEL6		(1 << 6)
/** PWM0_PWM_ELMR[0]_CSEL5 Comparison 5 Selection **/
#define PWM0_PWM_ELMR[0]_CSEL5		(1 << 5)
/** PWM0_PWM_ELMR[0]_CSEL4 Comparison 4 Selection **/
#define PWM0_PWM_ELMR[0]_CSEL4		(1 << 4)
/** PWM0_PWM_ELMR[0]_CSEL3 Comparison 3 Selection **/
#define PWM0_PWM_ELMR[0]_CSEL3		(1 << 3)
/** PWM0_PWM_ELMR[0]_CSEL2 Comparison 2 Selection **/
#define PWM0_PWM_ELMR[0]_CSEL2		(1 << 2)
/** PWM0_PWM_ELMR[0]_CSEL1 Comparison 1 Selection **/
#define PWM0_PWM_ELMR[0]_CSEL1		(1 << 1)
/** PWM0_PWM_ELMR[0]_CSEL0 Comparison 0 Selection **/
#define PWM0_PWM_ELMR[0]_CSEL0		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_elmr[1] PWMELMR[1] PWM Event Line 0 Mode Register 0
@{*/

/** PWM0_PWM_ELMR[1]_CSEL7 Comparison 7 Selection **/
#define PWM0_PWM_ELMR[1]_CSEL7		(1 << 7)
/** PWM0_PWM_ELMR[1]_CSEL6 Comparison 6 Selection **/
#define PWM0_PWM_ELMR[1]_CSEL6		(1 << 6)
/** PWM0_PWM_ELMR[1]_CSEL5 Comparison 5 Selection **/
#define PWM0_PWM_ELMR[1]_CSEL5		(1 << 5)
/** PWM0_PWM_ELMR[1]_CSEL4 Comparison 4 Selection **/
#define PWM0_PWM_ELMR[1]_CSEL4		(1 << 4)
/** PWM0_PWM_ELMR[1]_CSEL3 Comparison 3 Selection **/
#define PWM0_PWM_ELMR[1]_CSEL3		(1 << 3)
/** PWM0_PWM_ELMR[1]_CSEL2 Comparison 2 Selection **/
#define PWM0_PWM_ELMR[1]_CSEL2		(1 << 2)
/** PWM0_PWM_ELMR[1]_CSEL1 Comparison 1 Selection **/
#define PWM0_PWM_ELMR[1]_CSEL1		(1 << 1)
/** PWM0_PWM_ELMR[1]_CSEL0 Comparison 0 Selection **/
#define PWM0_PWM_ELMR[1]_CSEL0		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_sspr PWMSSPR PWM Spread Spectrum Register
@{*/

/** PWM0_PWM_SSPR_SPRDM Spread Spectrum Counter Mode **/
#define PWM0_PWM_SSPR_SPRDM		(1 << 24)

#define PWM0_PWM_SSPR_SPRD_SHIFT		0
#define PWM0_PWM_SSPR_SPRD_MASK		0xffffff
/** @defgroup pwm0_pwm_sspr_sprd SPRD Spread Spectrum Limit Value
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_sspup PWMSSPUP PWM Spread Spectrum Update Register
@{*/


#define PWM0_PWM_SSPUP_SPRDUP_SHIFT		0
#define PWM0_PWM_SSPUP_SPRDUP_MASK		0xffffff
/** @defgroup pwm0_pwm_sspup_sprdup SPRDUP Spread Spectrum Limit Value Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_smmr PWMSMMR PWM Stepper Motor Mode Register
@{*/

/** PWM0_PWM_SMMR_DOWN1 DOWN Count **/
#define PWM0_PWM_SMMR_DOWN1		(1 << 17)
/** PWM0_PWM_SMMR_DOWN0 DOWN Count **/
#define PWM0_PWM_SMMR_DOWN0		(1 << 16)
/** PWM0_PWM_SMMR_GCEN1 Gray Count ENable **/
#define PWM0_PWM_SMMR_GCEN1		(1 << 1)
/** PWM0_PWM_SMMR_GCEN0 Gray Count ENable **/
#define PWM0_PWM_SMMR_GCEN0		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_fpv2 PWMFPV2 PWM Fault Protection Value 2 Register
@{*/

/** PWM0_PWM_FPV2_FPZL3 Fault Protection to Hi-Z for PWML output on channel 3 **/
#define PWM0_PWM_FPV2_FPZL3		(1 << 19)
/** PWM0_PWM_FPV2_FPZL2 Fault Protection to Hi-Z for PWML output on channel 2 **/
#define PWM0_PWM_FPV2_FPZL2		(1 << 18)
/** PWM0_PWM_FPV2_FPZL1 Fault Protection to Hi-Z for PWML output on channel 1 **/
#define PWM0_PWM_FPV2_FPZL1		(1 << 17)
/** PWM0_PWM_FPV2_FPZL0 Fault Protection to Hi-Z for PWML output on channel 0 **/
#define PWM0_PWM_FPV2_FPZL0		(1 << 16)
/** PWM0_PWM_FPV2_FPZH3 Fault Protection to Hi-Z for PWMH output on channel 3 **/
#define PWM0_PWM_FPV2_FPZH3		(1 << 3)
/** PWM0_PWM_FPV2_FPZH2 Fault Protection to Hi-Z for PWMH output on channel 2 **/
#define PWM0_PWM_FPV2_FPZH2		(1 << 2)
/** PWM0_PWM_FPV2_FPZH1 Fault Protection to Hi-Z for PWMH output on channel 1 **/
#define PWM0_PWM_FPV2_FPZH1		(1 << 1)
/** PWM0_PWM_FPV2_FPZH0 Fault Protection to Hi-Z for PWMH output on channel 0 **/
#define PWM0_PWM_FPV2_FPZH0		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_wpcr PWMWPCR PWM Write Protection Control Register
@{*/


#define PWM0_PWM_WPCR_WPKEY_SHIFT		8
#define PWM0_PWM_WPCR_WPKEY_MASK		0xffffff
/** @defgroup pwm0_pwm_wpcr_wpkey WPKEY Write Protection Key
@{*/
/**@}*/

/** PWM0_PWM_WPCR_WPRG5 Write Protection Register Group 5 **/
#define PWM0_PWM_WPCR_WPRG5		(1 << 7)
/** PWM0_PWM_WPCR_WPRG4 Write Protection Register Group 4 **/
#define PWM0_PWM_WPCR_WPRG4		(1 << 6)
/** PWM0_PWM_WPCR_WPRG3 Write Protection Register Group 3 **/
#define PWM0_PWM_WPCR_WPRG3		(1 << 5)
/** PWM0_PWM_WPCR_WPRG2 Write Protection Register Group 2 **/
#define PWM0_PWM_WPCR_WPRG2		(1 << 4)
/** PWM0_PWM_WPCR_WPRG1 Write Protection Register Group 1 **/
#define PWM0_PWM_WPCR_WPRG1		(1 << 3)
/** PWM0_PWM_WPCR_WPRG0 Write Protection Register Group 0 **/
#define PWM0_PWM_WPCR_WPRG0		(1 << 2)

#define PWM0_PWM_WPCR_WPCMD_SHIFT		0
#define PWM0_PWM_WPCR_WPCMD_MASK		0x03
/** @defgroup pwm0_pwm_wpcr_wpcmd WPCMD Write Protection Command
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_wpsr PWMWPSR PWM Write Protection Status Register
@{*/


#define PWM0_PWM_WPSR_WPVSRC_SHIFT		16
#define PWM0_PWM_WPSR_WPVSRC_MASK		0xffff
/** @defgroup pwm0_pwm_wpsr_wpvsrc WPVSRC Write Protect Violation Source
@{*/
/**@}*/

/** PWM0_PWM_WPSR_WPHWS5 Write Protect HW Status **/
#define PWM0_PWM_WPSR_WPHWS5		(1 << 13)
/** PWM0_PWM_WPSR_WPHWS4 Write Protect HW Status **/
#define PWM0_PWM_WPSR_WPHWS4		(1 << 12)
/** PWM0_PWM_WPSR_WPHWS3 Write Protect HW Status **/
#define PWM0_PWM_WPSR_WPHWS3		(1 << 11)
/** PWM0_PWM_WPSR_WPHWS2 Write Protect HW Status **/
#define PWM0_PWM_WPSR_WPHWS2		(1 << 10)
/** PWM0_PWM_WPSR_WPHWS1 Write Protect HW Status **/
#define PWM0_PWM_WPSR_WPHWS1		(1 << 9)
/** PWM0_PWM_WPSR_WPHWS0 Write Protect HW Status **/
#define PWM0_PWM_WPSR_WPHWS0		(1 << 8)
/** PWM0_PWM_WPSR_WPVS Write Protect Violation Status **/
#define PWM0_PWM_WPSR_WPVS		(1 << 7)
/** PWM0_PWM_WPSR_WPSWS5 Write Protect SW Status **/
#define PWM0_PWM_WPSR_WPSWS5		(1 << 5)
/** PWM0_PWM_WPSR_WPSWS4 Write Protect SW Status **/
#define PWM0_PWM_WPSR_WPSWS4		(1 << 4)
/** PWM0_PWM_WPSR_WPSWS3 Write Protect SW Status **/
#define PWM0_PWM_WPSR_WPSWS3		(1 << 3)
/** PWM0_PWM_WPSR_WPSWS2 Write Protect SW Status **/
#define PWM0_PWM_WPSR_WPSWS2		(1 << 2)
/** PWM0_PWM_WPSR_WPSWS1 Write Protect SW Status **/
#define PWM0_PWM_WPSR_WPSWS1		(1 << 1)
/** PWM0_PWM_WPSR_WPSWS0 Write Protect SW Status **/
#define PWM0_PWM_WPSR_WPSWS0		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_cmp[0]_pwm_cmpv PWMCMP[0]PWMCMPV PWM Comparison 0 Value Register
@{*/

