grevaillot/svd_tools/headers/ATSAMV71J19B/pwm0.h
/** PWM0_PWM_CMP[0]_PWM_CMPV_CVM Comparison x Value Mode **/
#define PWM0_PWM_CMP[0]_PWM_CMPV_CVM		(1 << 24)

#define PWM0_PWM_CMP[0]_PWM_CMPV_CV_SHIFT		0
#define PWM0_PWM_CMP[0]_PWM_CMPV_CV_MASK		0xffffff
/** @defgroup pwm0_pwm_cmp[0]_pwm_cmpv_cv CV Comparison x Value
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_cmp[0]_pwm_cmpvupd PWMCMP[0]PWMCMPVUPD PWM Comparison 0 Value Update Register
@{*/

/** PWM0_PWM_CMP[0]_PWM_CMPVUPD_CVMUPD Comparison x Value Mode Update **/
#define PWM0_PWM_CMP[0]_PWM_CMPVUPD_CVMUPD		(1 << 24)

#define PWM0_PWM_CMP[0]_PWM_CMPVUPD_CVUPD_SHIFT		0
#define PWM0_PWM_CMP[0]_PWM_CMPVUPD_CVUPD_MASK		0xffffff
/** @defgroup pwm0_pwm_cmp[0]_pwm_cmpvupd_cvupd CVUPD Comparison x Value Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_cmp[0]_pwm_cmpm PWMCMP[0]PWMCMPM PWM Comparison 0 Mode Register
@{*/


#define PWM0_PWM_CMP[0]_PWM_CMPM_CUPRCNT_SHIFT		20
#define PWM0_PWM_CMP[0]_PWM_CMPM_CUPRCNT_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[0]_pwm_cmpm_cuprcnt CUPRCNT Comparison x Update Period Counter
@{*/
/**@}*/


#define PWM0_PWM_CMP[0]_PWM_CMPM_CUPR_SHIFT		16
#define PWM0_PWM_CMP[0]_PWM_CMPM_CUPR_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[0]_pwm_cmpm_cupr CUPR Comparison x Update Period
@{*/
/**@}*/


#define PWM0_PWM_CMP[0]_PWM_CMPM_CPRCNT_SHIFT		12
#define PWM0_PWM_CMP[0]_PWM_CMPM_CPRCNT_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[0]_pwm_cmpm_cprcnt CPRCNT Comparison x Period Counter
@{*/
/**@}*/


#define PWM0_PWM_CMP[0]_PWM_CMPM_CPR_SHIFT		8
#define PWM0_PWM_CMP[0]_PWM_CMPM_CPR_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[0]_pwm_cmpm_cpr CPR Comparison x Period
@{*/
/**@}*/


#define PWM0_PWM_CMP[0]_PWM_CMPM_CTR_SHIFT		4
#define PWM0_PWM_CMP[0]_PWM_CMPM_CTR_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[0]_pwm_cmpm_ctr CTR Comparison x Trigger
@{*/
/**@}*/

/** PWM0_PWM_CMP[0]_PWM_CMPM_CEN Comparison x Enable **/
#define PWM0_PWM_CMP[0]_PWM_CMPM_CEN		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_cmp[0]_pwm_cmpmupd PWMCMP[0]PWMCMPMUPD PWM Comparison 0 Mode Update Register
@{*/


#define PWM0_PWM_CMP[0]_PWM_CMPMUPD_CUPRUPD_SHIFT		16
#define PWM0_PWM_CMP[0]_PWM_CMPMUPD_CUPRUPD_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[0]_pwm_cmpmupd_cuprupd CUPRUPD Comparison x Update Period Update
@{*/
/**@}*/


#define PWM0_PWM_CMP[0]_PWM_CMPMUPD_CPRUPD_SHIFT		8
#define PWM0_PWM_CMP[0]_PWM_CMPMUPD_CPRUPD_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[0]_pwm_cmpmupd_cprupd CPRUPD Comparison x Period Update
@{*/
/**@}*/


#define PWM0_PWM_CMP[0]_PWM_CMPMUPD_CTRUPD_SHIFT		4
#define PWM0_PWM_CMP[0]_PWM_CMPMUPD_CTRUPD_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[0]_pwm_cmpmupd_ctrupd CTRUPD Comparison x Trigger Update
@{*/
/**@}*/

/** PWM0_PWM_CMP[0]_PWM_CMPMUPD_CENUPD Comparison x Enable Update **/
#define PWM0_PWM_CMP[0]_PWM_CMPMUPD_CENUPD		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_cmp[1]_pwm_cmpv PWMCMP[1]PWMCMPV PWM Comparison 0 Value Register
@{*/

/** PWM0_PWM_CMP[1]_PWM_CMPV_CVM Comparison x Value Mode **/
#define PWM0_PWM_CMP[1]_PWM_CMPV_CVM		(1 << 24)

#define PWM0_PWM_CMP[1]_PWM_CMPV_CV_SHIFT		0
#define PWM0_PWM_CMP[1]_PWM_CMPV_CV_MASK		0xffffff
/** @defgroup pwm0_pwm_cmp[1]_pwm_cmpv_cv CV Comparison x Value
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_cmp[1]_pwm_cmpvupd PWMCMP[1]PWMCMPVUPD PWM Comparison 0 Value Update Register
@{*/

/** PWM0_PWM_CMP[1]_PWM_CMPVUPD_CVMUPD Comparison x Value Mode Update **/
#define PWM0_PWM_CMP[1]_PWM_CMPVUPD_CVMUPD		(1 << 24)

#define PWM0_PWM_CMP[1]_PWM_CMPVUPD_CVUPD_SHIFT		0
#define PWM0_PWM_CMP[1]_PWM_CMPVUPD_CVUPD_MASK		0xffffff
/** @defgroup pwm0_pwm_cmp[1]_pwm_cmpvupd_cvupd CVUPD Comparison x Value Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_cmp[1]_pwm_cmpm PWMCMP[1]PWMCMPM PWM Comparison 0 Mode Register
@{*/


#define PWM0_PWM_CMP[1]_PWM_CMPM_CUPRCNT_SHIFT		20
#define PWM0_PWM_CMP[1]_PWM_CMPM_CUPRCNT_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[1]_pwm_cmpm_cuprcnt CUPRCNT Comparison x Update Period Counter
@{*/
/**@}*/


#define PWM0_PWM_CMP[1]_PWM_CMPM_CUPR_SHIFT		16
#define PWM0_PWM_CMP[1]_PWM_CMPM_CUPR_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[1]_pwm_cmpm_cupr CUPR Comparison x Update Period
@{*/
/**@}*/


#define PWM0_PWM_CMP[1]_PWM_CMPM_CPRCNT_SHIFT		12
#define PWM0_PWM_CMP[1]_PWM_CMPM_CPRCNT_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[1]_pwm_cmpm_cprcnt CPRCNT Comparison x Period Counter
@{*/
/**@}*/


#define PWM0_PWM_CMP[1]_PWM_CMPM_CPR_SHIFT		8
#define PWM0_PWM_CMP[1]_PWM_CMPM_CPR_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[1]_pwm_cmpm_cpr CPR Comparison x Period
@{*/
/**@}*/


#define PWM0_PWM_CMP[1]_PWM_CMPM_CTR_SHIFT		4
#define PWM0_PWM_CMP[1]_PWM_CMPM_CTR_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[1]_pwm_cmpm_ctr CTR Comparison x Trigger
@{*/
/**@}*/

/** PWM0_PWM_CMP[1]_PWM_CMPM_CEN Comparison x Enable **/
#define PWM0_PWM_CMP[1]_PWM_CMPM_CEN		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_cmp[1]_pwm_cmpmupd PWMCMP[1]PWMCMPMUPD PWM Comparison 0 Mode Update Register
@{*/


#define PWM0_PWM_CMP[1]_PWM_CMPMUPD_CUPRUPD_SHIFT		16
#define PWM0_PWM_CMP[1]_PWM_CMPMUPD_CUPRUPD_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[1]_pwm_cmpmupd_cuprupd CUPRUPD Comparison x Update Period Update
@{*/
/**@}*/


#define PWM0_PWM_CMP[1]_PWM_CMPMUPD_CPRUPD_SHIFT		8
#define PWM0_PWM_CMP[1]_PWM_CMPMUPD_CPRUPD_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[1]_pwm_cmpmupd_cprupd CPRUPD Comparison x Period Update
@{*/
/**@}*/


#define PWM0_PWM_CMP[1]_PWM_CMPMUPD_CTRUPD_SHIFT		4
#define PWM0_PWM_CMP[1]_PWM_CMPMUPD_CTRUPD_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[1]_pwm_cmpmupd_ctrupd CTRUPD Comparison x Trigger Update
@{*/
/**@}*/

/** PWM0_PWM_CMP[1]_PWM_CMPMUPD_CENUPD Comparison x Enable Update **/
#define PWM0_PWM_CMP[1]_PWM_CMPMUPD_CENUPD		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_cmp[2]_pwm_cmpv PWMCMP[2]PWMCMPV PWM Comparison 0 Value Register
@{*/

/** PWM0_PWM_CMP[2]_PWM_CMPV_CVM Comparison x Value Mode **/
#define PWM0_PWM_CMP[2]_PWM_CMPV_CVM		(1 << 24)

#define PWM0_PWM_CMP[2]_PWM_CMPV_CV_SHIFT		0
#define PWM0_PWM_CMP[2]_PWM_CMPV_CV_MASK		0xffffff
/** @defgroup pwm0_pwm_cmp[2]_pwm_cmpv_cv CV Comparison x Value
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_cmp[2]_pwm_cmpvupd PWMCMP[2]PWMCMPVUPD PWM Comparison 0 Value Update Register
@{*/

/** PWM0_PWM_CMP[2]_PWM_CMPVUPD_CVMUPD Comparison x Value Mode Update **/
#define PWM0_PWM_CMP[2]_PWM_CMPVUPD_CVMUPD		(1 << 24)

#define PWM0_PWM_CMP[2]_PWM_CMPVUPD_CVUPD_SHIFT		0
#define PWM0_PWM_CMP[2]_PWM_CMPVUPD_CVUPD_MASK		0xffffff
/** @defgroup pwm0_pwm_cmp[2]_pwm_cmpvupd_cvupd CVUPD Comparison x Value Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_cmp[2]_pwm_cmpm PWMCMP[2]PWMCMPM PWM Comparison 0 Mode Register
@{*/


#define PWM0_PWM_CMP[2]_PWM_CMPM_CUPRCNT_SHIFT		20
#define PWM0_PWM_CMP[2]_PWM_CMPM_CUPRCNT_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[2]_pwm_cmpm_cuprcnt CUPRCNT Comparison x Update Period Counter
@{*/
/**@}*/


#define PWM0_PWM_CMP[2]_PWM_CMPM_CUPR_SHIFT		16
#define PWM0_PWM_CMP[2]_PWM_CMPM_CUPR_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[2]_pwm_cmpm_cupr CUPR Comparison x Update Period
@{*/
/**@}*/


#define PWM0_PWM_CMP[2]_PWM_CMPM_CPRCNT_SHIFT		12
#define PWM0_PWM_CMP[2]_PWM_CMPM_CPRCNT_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[2]_pwm_cmpm_cprcnt CPRCNT Comparison x Period Counter
@{*/
/**@}*/


#define PWM0_PWM_CMP[2]_PWM_CMPM_CPR_SHIFT		8
#define PWM0_PWM_CMP[2]_PWM_CMPM_CPR_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[2]_pwm_cmpm_cpr CPR Comparison x Period
@{*/
/**@}*/


#define PWM0_PWM_CMP[2]_PWM_CMPM_CTR_SHIFT		4
#define PWM0_PWM_CMP[2]_PWM_CMPM_CTR_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[2]_pwm_cmpm_ctr CTR Comparison x Trigger
@{*/
/**@}*/

/** PWM0_PWM_CMP[2]_PWM_CMPM_CEN Comparison x Enable **/
#define PWM0_PWM_CMP[2]_PWM_CMPM_CEN		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_cmp[2]_pwm_cmpmupd PWMCMP[2]PWMCMPMUPD PWM Comparison 0 Mode Update Register
@{*/


