grevaillot/svd_tools/headers/ATSAMV71J19B/pwm0.h
/** @defgroup pwm0_pwm_ch_num[2]_pwm_cprd PWMCHNUM[2]PWMCPRD PWM Channel Period Register
@{*/


#define PWM0_PWM_CH_NUM[2]_PWM_CPRD_CPRD_SHIFT		0
#define PWM0_PWM_CH_NUM[2]_PWM_CPRD_CPRD_MASK		0xffffff
/** @defgroup pwm0_pwm_ch_num[2]_pwm_cprd_cprd CPRD Channel Period
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_ch_num[2]_pwm_cprdupd PWMCHNUM[2]PWMCPRDUPD PWM Channel Period Update Register
@{*/


#define PWM0_PWM_CH_NUM[2]_PWM_CPRDUPD_CPRDUPD_SHIFT		0
#define PWM0_PWM_CH_NUM[2]_PWM_CPRDUPD_CPRDUPD_MASK		0xffffff
/** @defgroup pwm0_pwm_ch_num[2]_pwm_cprdupd_cprdupd CPRDUPD Channel Period Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_ch_num[2]_pwm_ccnt PWMCHNUM[2]PWMCCNT PWM Channel Counter Register
@{*/


#define PWM0_PWM_CH_NUM[2]_PWM_CCNT_CNT_SHIFT		0
#define PWM0_PWM_CH_NUM[2]_PWM_CCNT_CNT_MASK		0xffffff
/** @defgroup pwm0_pwm_ch_num[2]_pwm_ccnt_cnt CNT Channel Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_ch_num[2]_pwm_dt PWMCHNUM[2]PWMDT PWM Channel Dead Time Register
@{*/


#define PWM0_PWM_CH_NUM[2]_PWM_DT_DTL_SHIFT		16
#define PWM0_PWM_CH_NUM[2]_PWM_DT_DTL_MASK		0xffff
/** @defgroup pwm0_pwm_ch_num[2]_pwm_dt_dtl DTL Dead-Time Value for PWMLx Output
@{*/
/**@}*/


#define PWM0_PWM_CH_NUM[2]_PWM_DT_DTH_SHIFT		0
#define PWM0_PWM_CH_NUM[2]_PWM_DT_DTH_MASK		0xffff
/** @defgroup pwm0_pwm_ch_num[2]_pwm_dt_dth DTH Dead-Time Value for PWMHx Output
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_ch_num[2]_pwm_dtupd PWMCHNUM[2]PWMDTUPD PWM Channel Dead Time Update Register
@{*/


#define PWM0_PWM_CH_NUM[2]_PWM_DTUPD_DTLUPD_SHIFT		16
#define PWM0_PWM_CH_NUM[2]_PWM_DTUPD_DTLUPD_MASK		0xffff
/** @defgroup pwm0_pwm_ch_num[2]_pwm_dtupd_dtlupd DTLUPD Dead-Time Value Update for PWMLx Output
@{*/
/**@}*/


#define PWM0_PWM_CH_NUM[2]_PWM_DTUPD_DTHUPD_SHIFT		0
#define PWM0_PWM_CH_NUM[2]_PWM_DTUPD_DTHUPD_MASK		0xffff
/** @defgroup pwm0_pwm_ch_num[2]_pwm_dtupd_dthupd DTHUPD Dead-Time Value Update for PWMHx Output
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_ch_num[3]_pwm_cmr PWMCHNUM[3]PWMCMR PWM Channel Mode Register
@{*/

/** PWM0_PWM_CH_NUM[3]_PWM_CMR_PPM Push-Pull Mode **/
#define PWM0_PWM_CH_NUM[3]_PWM_CMR_PPM		(1 << 19)
/** PWM0_PWM_CH_NUM[3]_PWM_CMR_DTLI Dead-Time PWMLx Output Inverted **/
#define PWM0_PWM_CH_NUM[3]_PWM_CMR_DTLI		(1 << 18)
/** PWM0_PWM_CH_NUM[3]_PWM_CMR_DTHI Dead-Time PWMHx Output Inverted **/
#define PWM0_PWM_CH_NUM[3]_PWM_CMR_DTHI		(1 << 17)
/** PWM0_PWM_CH_NUM[3]_PWM_CMR_DTE Dead-Time Generator Enable **/
#define PWM0_PWM_CH_NUM[3]_PWM_CMR_DTE		(1 << 16)
/** PWM0_PWM_CH_NUM[3]_PWM_CMR_TCTS Timer Counter Trigger Selection **/
#define PWM0_PWM_CH_NUM[3]_PWM_CMR_TCTS		(1 << 13)
/** PWM0_PWM_CH_NUM[3]_PWM_CMR_DPOLI Disabled Polarity Inverted **/
#define PWM0_PWM_CH_NUM[3]_PWM_CMR_DPOLI		(1 << 12)
/** PWM0_PWM_CH_NUM[3]_PWM_CMR_UPDS Update Selection **/
#define PWM0_PWM_CH_NUM[3]_PWM_CMR_UPDS		(1 << 11)
/** PWM0_PWM_CH_NUM[3]_PWM_CMR_CES Counter Event Selection **/
#define PWM0_PWM_CH_NUM[3]_PWM_CMR_CES		(1 << 10)
/** PWM0_PWM_CH_NUM[3]_PWM_CMR_CPOL Channel Polarity **/
#define PWM0_PWM_CH_NUM[3]_PWM_CMR_CPOL		(1 << 9)
/** PWM0_PWM_CH_NUM[3]_PWM_CMR_CALG Channel Alignment **/
#define PWM0_PWM_CH_NUM[3]_PWM_CMR_CALG		(1 << 8)

#define PWM0_PWM_CH_NUM[3]_PWM_CMR_CPRE_SHIFT		0
#define PWM0_PWM_CH_NUM[3]_PWM_CMR_CPRE_MASK		0x0f
/** @defgroup pwm0_pwm_ch_num[3]_pwm_cmr_cpre CPRE Channel Pre-scaler
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_ch_num[3]_pwm_cdty PWMCHNUM[3]PWMCDTY PWM Channel Duty Cycle Register
@{*/


#define PWM0_PWM_CH_NUM[3]_PWM_CDTY_CDTY_SHIFT		0
#define PWM0_PWM_CH_NUM[3]_PWM_CDTY_CDTY_MASK		0xffffff
/** @defgroup pwm0_pwm_ch_num[3]_pwm_cdty_cdty CDTY Channel Duty-Cycle
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_ch_num[3]_pwm_cdtyupd PWMCHNUM[3]PWMCDTYUPD PWM Channel Duty Cycle Update Register
@{*/


#define PWM0_PWM_CH_NUM[3]_PWM_CDTYUPD_CDTYUPD_SHIFT		0
#define PWM0_PWM_CH_NUM[3]_PWM_CDTYUPD_CDTYUPD_MASK		0xffffff
/** @defgroup pwm0_pwm_ch_num[3]_pwm_cdtyupd_cdtyupd CDTYUPD Channel Duty-Cycle Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_ch_num[3]_pwm_cprd PWMCHNUM[3]PWMCPRD PWM Channel Period Register
@{*/


#define PWM0_PWM_CH_NUM[3]_PWM_CPRD_CPRD_SHIFT		0
#define PWM0_PWM_CH_NUM[3]_PWM_CPRD_CPRD_MASK		0xffffff
/** @defgroup pwm0_pwm_ch_num[3]_pwm_cprd_cprd CPRD Channel Period
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_ch_num[3]_pwm_cprdupd PWMCHNUM[3]PWMCPRDUPD PWM Channel Period Update Register
@{*/


#define PWM0_PWM_CH_NUM[3]_PWM_CPRDUPD_CPRDUPD_SHIFT		0
#define PWM0_PWM_CH_NUM[3]_PWM_CPRDUPD_CPRDUPD_MASK		0xffffff
/** @defgroup pwm0_pwm_ch_num[3]_pwm_cprdupd_cprdupd CPRDUPD Channel Period Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_ch_num[3]_pwm_ccnt PWMCHNUM[3]PWMCCNT PWM Channel Counter Register
@{*/


#define PWM0_PWM_CH_NUM[3]_PWM_CCNT_CNT_SHIFT		0
#define PWM0_PWM_CH_NUM[3]_PWM_CCNT_CNT_MASK		0xffffff
/** @defgroup pwm0_pwm_ch_num[3]_pwm_ccnt_cnt CNT Channel Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_ch_num[3]_pwm_dt PWMCHNUM[3]PWMDT PWM Channel Dead Time Register
@{*/


#define PWM0_PWM_CH_NUM[3]_PWM_DT_DTL_SHIFT		16
#define PWM0_PWM_CH_NUM[3]_PWM_DT_DTL_MASK		0xffff
/** @defgroup pwm0_pwm_ch_num[3]_pwm_dt_dtl DTL Dead-Time Value for PWMLx Output
@{*/
/**@}*/


#define PWM0_PWM_CH_NUM[3]_PWM_DT_DTH_SHIFT		0
#define PWM0_PWM_CH_NUM[3]_PWM_DT_DTH_MASK		0xffff
/** @defgroup pwm0_pwm_ch_num[3]_pwm_dt_dth DTH Dead-Time Value for PWMHx Output
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_ch_num[3]_pwm_dtupd PWMCHNUM[3]PWMDTUPD PWM Channel Dead Time Update Register
@{*/


#define PWM0_PWM_CH_NUM[3]_PWM_DTUPD_DTLUPD_SHIFT		16
#define PWM0_PWM_CH_NUM[3]_PWM_DTUPD_DTLUPD_MASK		0xffff
/** @defgroup pwm0_pwm_ch_num[3]_pwm_dtupd_dtlupd DTLUPD Dead-Time Value Update for PWMLx Output
@{*/
/**@}*/


#define PWM0_PWM_CH_NUM[3]_PWM_DTUPD_DTHUPD_SHIFT		0
#define PWM0_PWM_CH_NUM[3]_PWM_DTUPD_DTHUPD_MASK		0xffff
/** @defgroup pwm0_pwm_ch_num[3]_pwm_dtupd_dthupd DTHUPD Dead-Time Value Update for PWMHx Output
@{*/
/**@}*/


/**@}*/

